app/controllers/posts_controller.rb

	def index
		respond_to do |format|
			format.json { render json: Post.all }
---
SELECT "posts".* FROM "posts"