app/controllers/projects_controller.rb

	def index
		respond_to do |format|
			format.json { render json: Project.all }
---
SELECT "projects".* FROM "projects"